# -*- mode:org;auto-fill-mode:t -*-
#+title: Org Syntax and Org Parsing

** Objects
The variable  ~org-element-all-objects~ contains the complete  list of
all OBJECTS.

#+caption: List of all Objects
#+name: list-of-all-objects
#+begin_src elisp :results list :exports both
(symbol-value 'org-element-all-objects)
#+end_src

#+RESULTS: list-of-all-objects
- bold
- code
- entity
- export-snippet
- footnote-reference
- inline-babel-call
- inline-src-block
- italic
- line-break
- latex-fragment
- link
- macro
- radio-target
- statistics-cookie
- strike-through
- subscript
- superscript
- table-cell
- target
- timestamp
- underline
- verbatim

Some    OBJECTS   are    "recursive",   listed    in   the    variable
~org-element-recursive-objects~:

#+caption: List of Recursive Objects
#+name:list-of-recursive-objects
#+begin_src elisp :results list :exports code
(symbol-value 'org-element-recursive-objects)
#+end_src

#+RESULTS:
- bold
- footnote-reference
- italic
- link
- subscript
- radio-target
- strike-through
- superscript
- table-cell
- underline

Most  objects cannot  contain objects.  Objects  can be  found in  the
following locations only:

- affiliated keywords defined in ~org-element-parsed-keywords~,

  #+begin_src elisp :results list :exports both
  (symbol-value 'org-element-parsed-keywords)
  #+end_src

  #+RESULTS:
  - CAPTION

- document properties,
- headline titles,
- inlinetask titles,
- item tags,
- paragraphs,
- table cells,
- table rows, which can only contain table cell objects,
- verse blocks.

